# Pandas
Same as excel Spreadsheet
One individual column is series
Dataframe is like excel spreadsheet

In [1]:
import pandas as pd
import numpy as np

In [2]:
mylist=[5.4,6.1,1.7,99.8]
myarray=np.array(mylist)

In [3]:
#convert list and np array in series
myseries1=pd.Series(data=mylist)
print(myseries1)
myseries2=pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [4]:
#print own individual items 
print(myseries1[2])

1.7

In [6]:
# we can add labels to the entries in the series 
mylabels=['first','second','third','fourth']
myseries3 = pd.Series(data=mylist, index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [7]:
# we need not be explicity about entries of pd.Series
myseries4 = pd.Series(mylist, mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [8]:
#access enties at a particular index location
print(myseries4['second'])

6.1

In [9]:
myseries5=pd.Series([5.5,1.1,1.8,1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    1.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    101.6
second      NaN
third       2.8
dtype: float64

In [10]:
#concatenate two series

In [12]:
df1=pd.concat([myseries4,myseries5],axis=1,sort=False) # axis 0 is row concat, 1 column concat
df1

           0    1
first    5.4  5.5
second   6.1  NaN
third    1.7  1.1
fourth  99.8  1.8
fifth    NaN  1.6

In [13]:
df1=pd.concat([myseries4,myseries5],axis=0,sort=False) # axis 0 is row concat, 1 column concat
df1

first      5.4
second     6.1
third      1.7
fourth    99.8
first      5.5
third      1.1
fourth     1.8
fifth      1.6
dtype: float64

In [25]:
#create a new dataframe
df2=pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  0.415025  0.348445 -0.219402  0.012729 -0.639470
1 -0.909467 -0.436826  1.892386  1.311527  0.080170
2 -0.484513 -1.414736 -0.327050  0.852031 -0.351033
3 -1.590225 -0.121706 -0.222405  0.443465  1.011950
4 -0.647810 -0.396453 -0.215646 -1.297188  0.766725

In [26]:
df3=pd.DataFrame(np.random.randn(5,5),index=['1st row','2nd row','3rd row','4th row','5th row'], 
                 columns=['1st col','2nd col','3rd col','4th col','5th col'])
df3

          1st col   2nd col   3rd col   4th col   5th col
1st row  0.350556 -1.504685  0.689255  0.492378  2.245821
2nd row  0.272125 -0.783298 -0.657994 -0.134819  0.103181
3rd row  0.363253 -1.224783  0.430183 -1.947706  0.105462
4th row  0.892515  0.924074 -0.808555 -1.218231  0.133485
5th row -0.215506  0.096828 -0.311196 -0.412519  0.015759

In [27]:
#in Pandas the first value alone in column and not rows
print(df3['2nd col'])

1st row   -1.504685
2nd row   -0.783298
3rd row   -1.224783
4th row    0.924074
5th row    0.096828
Name: 2nd col, dtype: float64

In [32]:
print(df3[['2nd col','3rd col']])

          2nd col   3rd col
1st row -1.504685  0.689255
2nd row -0.783298 -0.657994
3rd row -1.224783  0.430183
4th row  0.924074 -0.808555
5th row  0.096828 -0.311196

In [35]:
#loc for accessing the rows in the dataframe
print(df3.loc['2nd row'])

1st col    0.272125
2nd col   -0.783298
3rd col   -0.657994
4th col   -0.134819
5th col    0.103181
Name: 2nd row, dtype: float64

In [36]:
#iloc index location , even though re-labeled it exist
print(df3.iloc[2])

1st col    0.363253
2nd col   -1.224783
3rd col    0.430183
4th col   -1.947706
5th col    0.105462
Name: 3rd row, dtype: float64

In [37]:
df3.loc[['4th row','1st row'],['2nd col','3rd col']]

          2nd col   3rd col
4th row  0.924074 -0.808555
1st row -1.504685  0.689255

In [38]:
#logical indexing
df3>0

         1st col  2nd col  3rd col  4th col  5th col
1st row     True    False     True     True     True
2nd row     True    False    False    False     True
3rd row     True    False     True    False     True
4th row     True     True    False    False     True
5th row    False     True    False    False     True

In [40]:
print(df3[df3>0])

          1st col   2nd col   3rd col   4th col   5th col
1st row  0.350556       NaN  0.689255  0.492378  2.245821
2nd row  0.272125       NaN       NaN       NaN  0.103181
3rd row  0.363253       NaN  0.430183       NaN  0.105462
4th row  0.892515  0.924074       NaN       NaN  0.133485
5th row       NaN  0.096828       NaN       NaN  0.015759

In [41]:
df3['6th col']=np.random.randn(5,1)

In [42]:
df3

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.350556 -1.504685  0.689255  0.492378  2.245821 -1.436546
2nd row  0.272125 -0.783298 -0.657994 -0.134819  0.103181 -0.185790
3rd row  0.363253 -1.224783  0.430183 -1.947706  0.105462 -1.082623
4th row  0.892515  0.924074 -0.808555 -1.218231  0.133485  0.013307
5th row -0.215506  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [43]:
#drop column from dataframe
df3.drop('1st col',axis=1)

          2nd col   3rd col   4th col   5th col   6th col
1st row -1.504685  0.689255  0.492378  2.245821 -1.436546
2nd row -0.783298 -0.657994 -0.134819  0.103181 -0.185790
3rd row -1.224783  0.430183 -1.947706  0.105462 -1.082623
4th row  0.924074 -0.808555 -1.218231  0.133485  0.013307
5th row  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [44]:
df3

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.350556 -1.504685  0.689255  0.492378  2.245821 -1.436546
2nd row  0.272125 -0.783298 -0.657994 -0.134819  0.103181 -0.185790
3rd row  0.363253 -1.224783  0.430183 -1.947706  0.105462 -1.082623
4th row  0.892515  0.924074 -0.808555 -1.218231  0.133485  0.013307
5th row -0.215506  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [45]:
df4=df3.drop('1st col',axis=1)
df4

          2nd col   3rd col   4th col   5th col   6th col
1st row -1.504685  0.689255  0.492378  2.245821 -1.436546
2nd row -0.783298 -0.657994 -0.134819  0.103181 -0.185790
3rd row -1.224783  0.430183 -1.947706  0.105462 -1.082623
4th row  0.924074 -0.808555 -1.218231  0.133485  0.013307
5th row  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [55]:
#drop the row axis=0
df5=df3.drop('2nd row',axis=0)
df5

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.350556 -1.504685  0.689255  0.492378  2.245821 -1.436546
3rd row  0.363253 -1.224783  0.430183 -1.947706  0.105462 -1.082623
4th row  0.892515  0.924074 -0.808555 -1.218231  0.133485  0.013307
5th row -0.215506  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [56]:
#remove index tables
df5.reset_index()

     index   1st col   2nd col   3rd col   4th col   5th col   6th col
0  1st row  0.350556 -1.504685  0.689255  0.492378  2.245821 -1.436546
1  3rd row  0.363253 -1.224783  0.430183 -1.947706  0.105462 -1.082623
2  4th row  0.892515  0.924074 -0.808555 -1.218231  0.133485  0.013307
3  5th row -0.215506  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [48]:
df5

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.350556 -1.504685  0.689255  0.492378  2.245821 -1.436546
3rd row  0.363253 -1.224783  0.430183 -1.947706  0.105462 -1.082623
4th row  0.892515  0.924074 -0.808555 -1.218231  0.133485  0.013307
5th row -0.215506  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [57]:
df5.reset_index(inplace=True)
df5

     index   1st col   2nd col   3rd col   4th col   5th col   6th col
0  1st row  0.350556 -1.504685  0.689255  0.492378  2.245821 -1.436546
1  3rd row  0.363253 -1.224783  0.430183 -1.947706  0.105462 -1.082623
2  4th row  0.892515  0.924074 -0.808555 -1.218231  0.133485  0.013307
3  5th row -0.215506  0.096828 -0.311196 -0.412519  0.015759  0.706538

In [58]:
df5['new name']=['this','is','the','row']

In [59]:
df5

,index,1st col,2nd col,3rd col,4th col,5th col,6th col,new name
0,1st row,0.350556,-1.504685,0.689255,0.492378,2.245821,-1.436546,this
1,3rd row,0.363253,-1.224783,0.430183,-1.947706,0.105462,-1.082623,is
2,4th row,0.892515,0.924074,-0.808555,-1.218231,0.133485,0.013307,the
3,5th row,-0.215506,0.096828,-0.311196,-0.412519,0.015759,0.706538,row

In [62]:
df5.set_index('new name',inplace=True)

KeyError: "None of ['new name'] are in the columns"

In [ ]:
df